app/controllers/user_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "dez"], ["email", "dez@re.c"], ["created_at", "2018-08-09 21:21:23.392365"], ["updated_at", "2018-08-09 21:21:23.392365"]]
---
  def create
    @user = User.new(name: params[:session]["name"], email: params[:session]["email"])
    puts params
    @user.save